export const quizData = [
  {
    question: '洞窟の中、道が左、真ん中、右に分岐している。そのうち、1本が出口に続いているという。どの道を選びますか？',
    options: ['左', '真ん中', '右'],
    correctIndex: 0,
  },
  {
    question: '宝探しには青い妖精が必要である。A街には２匹の妖精いて１匹は青い妖精で、B街には青い妖精と赤い妖精が１匹ずついるという。A街から青でない方の１匹、B街からランダムに１匹がもらえるとするとき、どちらの街に頼みますか？\nただし、この世界には青と赤の2種類しかいないとする。',
    options: ['A街', 'B街'],
    correctIndex: 1,
  },
    {
    question: 'レアキノコを渡すと青い妖精をくれる人がいる。森にあるキノコは、レアキノコと普通のキノコがそれぞれ、15%、85%で存在し、探知犬は80%の確率でレアキノコを判定できるという。次のうちどちらを渡すか。\n・探知犬が森で見つけたキノコ\n・50%の確率でレアキノコが当たる店で買ったキノコ',
    options: ['森で探す', '店で買う'],
    correctIndex: 2,
  },
  {
    question: '宝箱を４つ見つけた。宝箱は1つだけ開けられるものとする。※妖精の行動パターンは以下のとおり。\n・宝箱を選択していないときは、外れの宝箱を教えてくれる。\n・宝箱を選択しているときは、選択していない宝箱から外れの宝箱を教えてくれる。',
    options: ['宝箱A', '宝箱B','宝箱C', '宝箱D'],
    correctIndex: 3,
  },
];
